template-basic/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "ingredients", "created_at", "updated_at", "stars", "time_to_make") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "AAAAA"], ["ingredients", "bbbbbbbbbbbb"], ["created_at", "2023-10-18 21:04:22.362177"], ["updated_at", "2023-10-18 21:04:22.362177"], ["stars", 3], ["time_to_make", 12]]
---
    def create
        # params recebe os parametros do formulário (new.html.erb)
        # puts params

        @recipe = Recipe.new(recipe_params)
        @recipe.save